# Climate Risk Analytics

In [39]:
import pandas as pd
import pandasql as ps

ModuleNotFoundError: No module named 'pandasql'

## Question #1: Emission Data Processing

### Dataset

In [2]:
import pandas as pd


df_rbc=pd.DataFrame({
    "CLIENT_ID":[528,98,122,238,426],
    "NAME":["STAR FLIGHT INC.","SUPERMARKETX LTD.","OIL TEK INC.","HYDRO CANADA","FUELX"],
    "TOTAL_OUTSTANDING":[1408673,209321,57002,-2,39822]
})
display(df_rbc)

   CLIENT_ID               NAME  TOTAL_OUTSTANDING
0        528   STAR FLIGHT INC.            1408673
1         98  SUPERMARKETX LTD.             209321
2        122       OIL TEK INC.              57002
3        238       HYDRO CANADA                 -2
4        426              FUELX              39822

### Emission Dataset

In [3]:
df_emi=pd.DataFrame({
    "CLIENT_ID":[528,238,426],
    "EMISSIONS_SCOPE_1":[12039,2102,53034],
    "EMISSIONS_SCOPE_2":[203,492,1038],
})
display(df_emi)

   CLIENT_ID  EMISSIONS_SCOPE_1  EMISSIONS_SCOPE_2
0        528              12039                203
1        238               2102                492
2        426              53034               1038

Problem 1a: RBC Data Preprocessing

In [6]:
# Remove any clients with negative tot_os from the RBC Dataset
df_rbc1=df_rbc[df_rbc['TOTAL_OUTSTANDING']> 0]
df_rbc1

   CLIENT_ID               NAME  TOTAL_OUTSTANDING
0        528   STAR FLIGHT INC.            1408673
1         98  SUPERMARKETX LTD.             209321
2        122       OIL TEK INC.              57002
4        426              FUELX              39822

Problem 1b: Emission Data Preprocessing

In [15]:
# Create a column named "EMISSIONS_TOTAL" by adding EMISSIONS_SCOPE_1 to EMISSIONS_SCOPE_2 in the Emission Dataset
df_emi
EMISSIONS_TOTAL = df_emi['EMISSIONS_SCOPE_1'] + df_emi ['EMISSIONS_SCOPE_2']
EMISSIONS_TOTAL
df_emi ['EMISSIONS_TOTAL'] = EMISSIONS_TOTAL
df_emi

   CLIENT_ID  EMISSIONS_SCOPE_1  EMISSIONS_SCOPE_2  EMISSIONS_TOTAL
0        528              12039                203            12242
1        238               2102                492             2594
2        426              53034               1038            54072

Problem 1c: Join Datasets

In [18]:
# Join Emission Dataset to RBC Dataset using the CLIENT_ID column
df1= df_rbc.merge(df_emi,on ="CLIENT_ID", how="left")
df1

,CLIENT_ID,NAME,TOTAL_OUTSTANDING,EMISSIONS_SCOPE_1,EMISSIONS_SCOPE_2,EMISSIONS_TOTAL
0,528,STAR FLIGHT INC.,1408673,12039.0,203.0,12242.0
1,98,SUPERMARKETX LTD.,209321,NaN,NaN,NaN
2,122,OIL TEK INC.,57002,NaN,NaN,NaN
3,238,HYDRO CANADA,-2,2102.0,492.0,2594.0
4,426,FUELX,39822,53034.0,1038.0,54072.0

Problem 1d: Calculate Emission Intensity

In [38]:
# Use the following formula to calculate emission intensity:
# Σ EMISSIONS_TOTAL / Σ TOTAL_OUTSTANDING * 1000000

emission_intensity = (df1['EMISSIONS_TOTAL'].sum() / df1 ['TOTAL_OUTSTANDING'].sum())* 1000000
emission_intensity
df1 ['emission_intensity'] = emission_intensity
df1

,CLIENT_ID,NAME,TOTAL_OUTSTANDING,EMISSIONS_SCOPE_1,EMISSIONS_SCOPE_2,EMISSIONS_TOTAL,emission_intensity
0,528,STAR FLIGHT INC.,1408673,12039.0,203.0,12242.0,40183.903113
1,98,SUPERMARKETX LTD.,209321,NaN,NaN,NaN,40183.903113
2,122,OIL TEK INC.,57002,NaN,NaN,NaN,40183.903113
3,238,HYDRO CANADA,-2,2102.0,492.0,2594.0,40183.903113
4,426,FUELX,39822,53034.0,1038.0,54072.0,40183.903113

## Question #2: Modified Fibonacci Sequence

Write a function that returns the Nth number of the modified Fibonacci series where A and B are the first two terms.

In [23]:
# Please Modify the following function
def findNthNumber(A, B, N):
    sum = 0
    for i in range(2, N):
        sum = A + B
 
        A = B
 
        B = sum
     
    
    return sum

In [24]:
findNthNumber(5, 7, 10) #Expecting 343

343

### Question #3: SQL

Obtain the most recent TOTAL_OUTSTANDING for each client where the most recent year is more than 2019. Use the following CLIENT TABLE for your analysis.

In [30]:
df_sql=pd.DataFrame({
    "CLIENT_ID":[528,528,98,98,98,426],
    "NAME":["STAR FLIGHT INC.","STAR FLIGHT INC.","OIL TEK INC.","OIL TEK INC.","OIL TEK INC.","FUELX"],
    "TOTAL_OUTSTANDING":[1408673,1308271,57002,78002,100236,502184],
    "YEAR": [2021,2020,2020,2018,2017,2019]
})
print("CLIENT TABLE")
display(df_sql)

CLIENT TABLE

   CLIENT_ID              NAME  TOTAL_OUTSTANDING  YEAR
0        528  STAR FLIGHT INC.            1408673  2021
1        528  STAR FLIGHT INC.            1308271  2020
2         98      OIL TEK INC.              57002  2020
3         98      OIL TEK INC.              78002  2018
4         98      OIL TEK INC.             100236  2017
5        426             FUELX             502184  2019

In [31]:
# Modify the following SQL query
ps.sqldf("""
SELECT NAME, sum(TOTAL_OUTSTANDING) as TOTAL_OUTSTANDING , YEAR FROM df_sql
where year > 2019
group by 1,3

""")

NameError: name 'ps' is not defined